Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Thanks to the people who reviewed this document for me, before it went public.
es: Las personas que han revisado este documento antes de su publicación:

source: Thanks!
es: Se lo agradeceremos...

source: That is, the formal argument is an L</alias> for the actual argument.
es: Es decir, el argumento formal es un L</alias> del argumento real.

source: That might mean that Perl either saves them something (time, headaches, money) or gives them something (flexibility, power, testability).
es: Esta ayuda puede implicar un ahorro (de tiempo, dinero o dolores de cabeza) o una aportación (en forma de flexibilidad, eficacia o facilidad para realizar pruebas).

source: That document covers many details on how to create a good patch.
es: Este documento explica muchos detalles sobre la manera correcta de crear un parche.

source: That explicit association is created by the built-in C<bless> function, which is typically used within the I<constructor> subroutine of the class.
es: Esta asociación se crea mediante la función predefinida C<bless>, que normalmente se usa dentro del I<constructor> de la clase.

source: That is any branch matching C<m!^(blead|maint|perl)!>.
es: Es decir, cualquier rama cuyo nombre coincida con C<m!^(blead|maint|perl)!>.

source: That is the source of much confusion.
es: Y crea muchas confusiones.

source: That is, C<$::sail> is equivalent to C<$main::sail>.
es: Es decir, C<$::vela> equivale a C<$main::vela>.

source: That is, change "." to match any character whatsoever, even a newline, which normally it would not match.
es: Es decir, cambia el significado de "." para que detecte cualquier carácter, incluso el de nueva línea, que normalmente no detectaría.

source: That is, change "^" and "$" from matching the start or end of the string to matching the start or end of any line anywhere within the string.
es: Es decir, cambia el significado de "^" y "$", que detectan el principio y el final de la cadena respectivamente, para que detecten el principio y el final de cualquier línea en cualquier parte de la cadena.

source: That is, when a LIST is evaluated, each element of the list is evaluated in list context, and the resulting list value is interpolated into LIST just as if each individual element were a member of LIST.
es: Es decir, cuando se evalúa una LISTA, cada uno de sus elementos se evalúa en contexto de lista, y el valor de lista resultante se interpola en LISTA como si cada elemento individual fuera un miembro de LISTA.

source: That may sound positive, but it's best to avoid it.
es: Es posible que este nombre sugiera algo positivo, pero es mejor evitar que suceda.

source: That means it starts with the first parent in the C<@ISA> array, and then searches all of its parents, grandparents, etc.
es: Esto significa que se comienza buscando en la primera clase primaria del array C<@ISA> y después se busca en todas las clases primarias de esta, y así sucesivamente.

source: That means that you very probably shouldn't use C, C<_utf8_on> or C<_utf8_off> at all.
es: Esto significa que es muy probable que nunca tenga que usar C, C<_utf8_on> y C<_utf8_off>.

source: That means there's basically two numbers, 0 and 1.
es: Eso significa que hay básicamente dos números, 0 y 1.

source: That means when we call C<< Critter->new() >>, the C<new()> method receives the string C<"Critter"> as its first argument.
es: Esto significa que la llamada C<< Bicho->new() >>, hace que el método C<new()> reciba la cadena C<"Bicho"> como primer argumento.

source: That method may be best because otherwise you won't treat IEEE notations like C<NaN> or C<Infinity> properly.
es: Este método puede ser mejor, ya que de otro modo no se pueden tratar notaciones IEEE como C<Nan> o C<Infinity>.

source: That said, there will always be small, focused, special-purpose languages dedicated to a specific problem domain that are simply more convenient for certain kinds of problems.
es: Sin embargo, siempre habrá lenguajes reducidos de propósito específico orientados a un dominio de un problema concreto, más cómodos para afrontar determinados tipos de problemas.

source: That sugar is just a set of exported functions that make declaring how your class works simpler and more palatable.
es: Esta simplificación consiste en un conjunto de funciones exportadas que hacen que la declaración de las clases sea más sencilla y agradable.

source: That will efficiently match a nonempty group with matching parentheses two levels deep or less.
es: Detectará de manera eficiente un grupo no vacío de parejas de paréntesis anidados a dos niveles de profundidad o menos.

source: That will print out:
es: Esto imprimirá:

source: That won't work at all, because C<.*> was greedy and gobbled up the whole string.
es: Eso no funcionará, ya que C<.*> es avaricioso y engullirá toda la cadena.

source: That'll get you scolded on perl5-porters, so don't do that.
es: Eso hará que los perl5-porters le regañen, así que procure evitarlo.

source: That's because strings that aren't numbers count as 0, just as they do in B<awk>:
es: La razón de esto es que las cadenas que no son números cuentan como 0, igual que en B<awk>:

source: That's a mouthful, so let's look at some code:
es: Suena complicado, así que veamos algunos ejemplos de código:

source: That's all you need to do on Unix systems with dynamic linking.
es: Esto es todo lo que tiene que hacer en los sistemas Unix con vinculación dinámica.

source: That's because C<*HANDLE{IO}> only works if HANDLE has already been used as a handle.
es: Esto se debe a que C<*IDENTIFICADOR{IO}> solo funciona si ya se ha utilizado IDENTIFICADOR como un identificador.

source: That's because C<.*> was greedy, so you get everything between the I<first> "foo" and the I<last> "bar".
es: Esto se debe a que C<.*> es avaricioso, por lo que obtiene todo lo que hay entre la I<primera> instancia de "mesa" y la I<última> instancia de "come".

source: That's because both scalars and lists are automatically interpolated into lists.
es: Esto se debe a que ambos tipos, escalares y listas, se interpolan automáticamente en listas.

source: That's because in PerlThink, the righthand side of an C<s///> is a double-quoted string.
es: No se recomienda porque en el Pensamiento Perliano, el lado derecho de una construcción C<s///> es una cadena entre comillas dobles.

source: That's because the C<(?!foo)> is just saying that the next thing cannot be "foo"--and it's not, it's a "bar", so "foobar" will match.
es: Esto se debe a que C<(?!foo)> solo dice que lo siguiente no puede ser "foo" (y no lo es, es "bar", por lo que se detectará "foobar").

source: That's because there are so many different ways to split a long string into several substrings.
es: Esto se debe a que hay muchas maneras distintas de dividir una cadena larga en subcadenas.

source: That's it!
es: ¡Y ya está!

source: That's probably because you forgot libraries, or library paths differ.
es: Probablemente se deba a que olvidó copiar las bibliotecas, o a que las rutas de acceso de las bibliotecas difieren.

source: That's psychology....
es: Usamos técnicas psicológicas...

source: That's the C part done.
es: Ya hemos corregido el código C.

source: That's very useful if you use things like C<substr>, or C<length>.
es: Esto resulta muy útil al utilizar funciones como C<substr> o C<length>.

source: That's why a 25-cent piece today is still "two bits".)
es: Es por eso que actualmente una moneda de 25 centavos sigue llamándose "two bits" (dos partes).

source: That's why it's common practice to include alternatives in parentheses: to minimize confusion about where they start and end.
es: Por eso, es una práctica común incluir las alternativas entre paréntesis, para minimizar la confusión acerca de dónde empiezan y dónde acaban.

source: That's why it's good to use references sometimes.
es: Es por eso que, en algunas situaciones, es recomendable utilizar referencias.

source: That's why the second call to C<blessed( $bar )> returns false.
es: Esto es por lo que la segunda llamada a C<blessed( $bar )> devuelve falso.

source: That's your current package name.
es: Ese es el nombre del paquete actual.

source: The "lib/anydbm" and "pragma/warnings" tests will almost certainly fail.
es: Es muy probable que no se superen las pruebas "lib/anydbm" y "pragma/warnings".

source: The Boolean context is just a special kind of scalar context where no conversion to a string or a number is ever performed.
es: El contexto booleano es simplemente un tipo especial de contexto de escalar para el cual no se realiza ninguna conversión a cadena o a número.

source: The L<UNIVERSAL> class is implemented by the Perl core, and provides several default methods, such as C<isa()>, C<can()>, and C<VERSION()>.
es: La clase L<UNIVERSAL> está implementada en el núcleo de Perl y proporciona varios métodos predefinidos, como C<isa()>, C<can()> y C<VERSION()>.

source: The core, the standard Perl library, the optional modules, and the documentation you're reading now were all written by volunteers.
es: Los componentes del núcleo, la biblioteca Perl estándar, los módulos opcionales y esta documentación han sido desarrollados por voluntarios.

source: The current input line number (for the file that was most recently read via C<< E<lt>FHE<gt> >>) is represented by the C<$.> (C<$INPUT_LINE_NUMBER>) variable.
es: El número de línea de entrada actual (para el último archivo leído a través de C<< E<lt>FHE<gt> >>) se representa con la variable C<$.> (C<$INPUT_LINE_NUMBER>).

source: The current source file's line number is represented by C<__LINE__>.
es: El número línea actual del código se representa mediante C<__LINE__>.

source: The defined version is just a string of length zero, such as C<"">.
es: La versión definida es solo una cadena de longitud cero, como C<"">.

source: The first alternative includes everything from the last pattern delimiter ("(", "(?:", etc. or the beginning of the pattern) up to the first "|", and the last alternative contains everything from the last "|" to the next closing pattern delimiter.
es: La primera alternativa incluye todo, desde el último delimitador de patrón ("(", "(?:", etc. o el comienzo del patrón) hasta el primer "|"; la última alternativa contiene todo desde el último "|" hasta el siguiente delimitador de cierre del patrón.

source: The lesson is to C<use locale> and not C</l> explicitly.
es: Así pues, debe utilizar C<use locale> en lugar de agregar C</l> explícitamente.

source: The only difference is that in a class, the subroutines may expect a reference to an object or the name of a class as the first argument.
es: La única diferencia es que en una clase la subrutina recibirá como primer argumento un objeto o el nombre de una clase.

source: The opposite of "virtual" is "transparent", which means providing the reality of something without the appearance, as in: Perl handles the variable-length UTF-8 character encoding transparently.
es: Lo opuesto de "virtual" es "transparente", que significa que proporciona la realidad de algo sin la apariencia. Por ejemplo, Perl procesa la codificación de caracteres UTF-8 de longitud variable de forma transparente.

source: The package you are looking at could have overridden the C<VERSION> method.
es: El paquete en que se comprueba podría haber sobrescrito el método C<VERSION>.

source: The sequences (C, C, etc.) later in the same pattern refer back to the corresponding subpattern in the current match.
es: Se pueden colocar las secuencias (C, C, etc.) más adelante en el mismo patrón para hacer referencia al subpatrón correspondiente en la detección actual.

source: The workaround is to use global (C<our>) variables.
es: La solución consiste en usar variables globales (C<our>).

source: The "*" quantifier is equivalent to C<{0,}>, the "+" quantifier to C<{1,}>, and the "?" quantifier to C<{0,1}>.
es: El cuantificador "*" es equivalente a C<{0,}>, el cuantificador "+" a C<{1,}> y el cuantificador "?" a C<{0,1}>.

source: The "+ - !" become from the diff(1) context diff output format.
es: Los signos "+ - !" vienen del formato de salida de diferencias en contexto de diff(1).

source: The "core".."doc" are explained below.
es: Las etiquetas "core".."doc" se describen más abajo.

source: The "core"..."doc" mean the following files from the Perl source code distribution.
es: Las etiquetas "core"..."doc" hacen referencia a los siguientes archivos de la distribución de código fuente de Perl.

source: The "de" part of it refers to the fact that you're taking away one level of L</indirection>.
es: El prefijo "des" hace referencia al hecho de que al hacer esto se elimina un nivel de L</direccionamiento indirecto>.

source: The "diff lines kB" means that for example the patch 5.003_08, to be applied on top of the 5.003_07 (or whatever was before the 5.003_08) added lines for 110 kilobytes, it removed lines for 19 kilobytes, and changed lines for 424 kilobytes.
es: "dif. líneas en kB" significa que, por ejemplo, para el parche 5.003_08, que se aplicó a la versión 5.003_07 (o lo que hubiera antes de la versión 5.003_08), se agregaron 110 kilobytes de líneas, se quitaron 19 kilobytes de líneas y se modificaron 424 kilobytes de líneas.

source: The "first bad commit" has then to be understood as the "first commit where the bug is solved".
es: Se considera que la "primera confirmación incorrecta" es la "primera confirmación en la que el error está solucionado".

source: The "grab all you can, and do not give anything back" semantic is desirable in many situations where on the first sight a simple C<()*> looks like the correct solution.
es: La semántica "capturar todo lo que se pueda y no devolver nada" es deseable en muchas situaciones en las que, a primera vista, un simple patrón C<()*> parece la solución correcta.

source: The "l" is short for "left", as in the left side of an assignment, a typical place for lvalues.
es: Decimos "izquierda" porque un lugar típico de los valores-izquierda es el lado izquierdo de una asignación.

source: The "or" in the previous sentence separated the two alternatives.
es: En la frase anterior se usa la palabra "o" como separador de las dos alternativas.

source: The "symbolic" part just means that you can talk to the debugger using the same symbols with which your program is written.
es: El término "simbólico" simplemente quiere decir que puede comunicarse con el depurador mediante los mismos símbolos que usó para escribir el programa.

source: The '$' symbol works semantically like the English word "the" in that it indicates a single value is expected.
es: Desde el punto de vista semántico, el signo "$" desempeña la misma función que la palabra "el" o "la" en español; es decir, indica que se espera un único valor.

source: The 'blead' branch will become the next production release of Perl.
es: La rama 'blead' se convertirá en la siguiente versión de producción de Perl.

source: The 5.004 maintenance track.
es: Serie de mantenimiento de v5.004.

source: The American Standard Code for Information Interchange (a 7-bit character set adequate only for poorly representing English text).
es: American Standard Code for Information Interchange (un juego de caracteres de 7 bits que solo es adecuado para representar texto en inglés de una forma insuficiente).

source: The B<-X> option looks for an entry whose basename matches the name given on the command line in the file C<$Config{archlib}/pod.idx>.
es: La opción B<-X> busca en el archivo C<$Config{archlib}/pod.idx> una entrada cuyo nombre base coincida con el nombre especificado en la línea de comandos.

source: The B<-f> option followed by the name of a perl built-in function will extract the documentation of this function from L<perlfunc>.
es: La opción B<-f> seguida del nombre de una función predefinida de perl extrae de L<perlfunc> la documentación de la función.

source: The B<-q> option takes a regular expression as an argument.
es: La opción B<-q> consume una expresión regular como argumento.

source: The B<-v> option followed by the name of a Perl predefined variable will extract the documentation of this variable from L<perlvar>.
es: La opción B<-v> seguida del nombre de una variable predefinida de Perl extrae de L<perlvar> la documentación de la variable.

source: The B<-w> switch is not mandatory.
es: El uso del modificador B<-w> no es obligatorio.

source: The B<begincheck> program makes it all clear, eventually:
es: El programa B<begincheck> expone esto de forma clara (o eso esperamos):

source: The BUILD and INSTALL steps are identical to those for Unix.
es: Los pasos COMPILAR e INSTALAR son idénticos a los de Unix.

source: The C application assumes that I<all> keys and values are NULL terminated.
es: La aplicación en C supone que I<todas> las claves y sus valores correspondientes terminan con un carácter NULL.

source: The C source code and header files mostly live in the root of the source tree.
es: La mayor parte del código C y los archivos de encabezado se encuentran en el directorio raíz del árbol de código fuente.

source: The C style for loop is rarely needed in Perl since Perl provides the more friendly list scanning C<foreach> loop.
es: El bucle for de C no se suele usar, ya que Perl proporciona una alternativa más sencilla para recorrer listas, el bucle C<foreach>.

source: The C3 method resolution order added in 5.10.0 has been re-implemented as a plugin, without changing its Perl-space interface.
es: El orden de resolución de métodos C3 agregado en 5.10.0 se ha reimplementado como un complemento sin cambiar su interfaz del espacio Perl.

source: The C3 order also lets you call methods in sibling classes with the C<next> pseudo-class.
es: El orden C3 también permite llamar a métodos en clases del mismo nivel mediante la seudoclase C<next>.

source: The C<#> character is also treated as a metacharacter introducing a comment, just as in ordinary Perl code.
es: El carácter C<#> también es un metacarácter que antecede a un comentario, al igual que en el código Perl normal.

source: The C<$/> variable contains the string that terminates a L<readline|perlfunc/readline> operation, which L<chomp|perlfunc/chomp> deletes from the end.
es: La variable C<$/> contiene la cadena con la que termina una operación L<readline|perlfunc/readline>, que L<chomp|perlfunc/chomp> elimina del final.

source: The C<*foo{THING}> notation can also be used to obtain references to the individual elements of *foo.
es: También se puede usar la notación C<*foo{COSA}> para obtener referencias a los elementos individuales de *foo.

source: The C<*x = \$y> mechanism may be used to pass and return cheap references into or from subroutines if you don't want to copy the whole thing.
es: El mecanismo C<*x = \$y> se puede usar para pasar y devolver referencias sencillas a (o desde) las subrutinas si no desea copiar el valor completo.

source: The C<++> and C<--> operators can be either prefix or postfix.
es: Los operadores C<++> y C<--> pueden ser de prefijo o de postfijo.

source: The C<-A> command line switch
es: El modificador de línea de comandos C<-A>

source: The C<-A> omits the Autoloader code, C<-X> omits XS elements, C<--skip-exporter> omits the Exporter code, C<--use-new-tests> sets up a modern testing environment, and C<-n> specifies the name of the module.
es: El modificador C<-A> omite el código de Autoloader, C<-X> omite los elementos XS, C<--skip-exporter> omite el código de Exporter, C<--use-new-tests> configura un entorno de pruebas moderno y C<-n> especifica el nombre del módulo.

source: The C<-a> option is used to include all files that git tracks that you have changed.
es: La opción C<-a> se usa para incluir todos los archivos modificados que están en la lista de seguimiento de git.

source: The C<-m> option is used to specify the commit message.
es: La opción C<-m> se usa para especificar el mensaje de confirmación.

source: The C<//> matching operator is documented in L<perlop>.
es: El operador de detección de coincidencias C<//> se describe en L<perlop>.

source: The C</a> modifier, on the other hand, may be useful.
es: En cambio, el modificador C</a> le puede resultar útil.

source: The C</d>, C</u>, and C</l> modifiers are not likely to be of much use to you, and so you need not worry about them very much.
es: Los modificadores C</d>, C</u> y C</l> no serán, probablemente, de gran utilidad para la mayoría de los usuarios, por lo que no es necesario que los tenga en cuenta.

source: The C</l> and C</u> modifiers are automatically selected for regular expressions compiled within the scope of various pragmas, and we recommend that in general, you use those pragmas instead of specifying these modifiers explicitly.
es: Los modificadores C</l> y C</u> se seleccionan automáticamente para las expresiones regulares compiladas dentro del ámbito de diversos pragmas y, en general, se recomienda utilizar los pragmas en lugar de especificar de forma explícita estos modificadores.

source: The C<< -> >> syntax is also used when dereferencing a reference.
es: La sintaxis C<< -> >> también se usa para desreferenciar una referencia.

source: The C<< <> >> operator is most often seen in a C<while> loop:
es: El operador C<< <> >> se suele utilizar en un bucle C<while>:

source: The C<< => >> operator is mostly just a more visually distinctive synonym for a comma, but it also arranges for its left-hand operand to be interpreted as a string if it's a bareword that would be a legal simple identifier.
es: Este operador es más que nada un distintivo visual sinónimo de una coma, pero también se encarga de que el operando de la izquierda se interprete como una cadena, si es una palabra suelta que se pudiera considerar como un identificador simple válido.

source: The C<@ISA> array contains a list of that class's parent classes, if any.
es: El array C<@ISA> contiene la lista de clases primarias (si las hubiera).

source: The C<CHECK> and C<INIT> blocks in code compiled by C<require>, string C<do>, or string C<eval> will not be executed if they occur after the end of the main compilation phase; that can be a problem in mod_perl and other persistent environments which use those functions to load code at runtime.
es: Los bloques C<CHECK> e C<INIT> en código compilado por C<require> y en funciones C<do> o C<eval> de cadena no se ejecutarán si están después del final de la fase principal de compilación; esto puede suponer un problema en el entorno mod_perl y otros entornos permanentes que usan esas funciones para cargar código en tiempo de ejecución.

source: The C<Config> module will also let you interrogate values determined by the B<Configure> program when Perl was installed.
es: El módulo C<Config> también permite consultar valores que el programa B<Configure> determinó durante la instalación de Perl.

source: The C<DOES> method returns I<true> if its object claims to perform the role C<$role>.
es: El método C<DOES> devuelve I<verdadero> si el objeto proclama realizar el rol indicado en C<$rol>.

source: The C<File> class would then be B<composed> of several other objects.
es: La clase C<Archivo> estaría B<compuesta> de varios objetos.

source: The C<KELVIN SIGN>, for example matches the letters "k" and "K"; and C<LATIN SMALL LIGATURE FF> matches the sequence "ff", which, if you're not prepared, might make it look like a hexadecimal constant, presenting another potential security issue.
es: Por ejemplo, C<KELVIN SIGN> coincide con las letras "k" y "K", y C<LATIN SMALL LIGATURE FF> coincide con la secuencia "ff", por lo que, si no esta preparado, puede hacer que se vea como una constante hexadecimal, lo que presenta otro posible problema de seguridad.
